0.1.0/tutorials/incompressible/simple/motor_bike/0.org/include/frontBackUpperPatches
upperWall
{
    type slip;
}

frontAndBack
{
    type slip;
}
