0.1.0/tutorials/incompressible/simple/motor_bike/0.org/omega
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      omega;
}

#include        "include/initialConditions"
dimensions      [0 0 -1 0 0 0 0];
internalField   uniform $turbulentOmega;

boundaryField
{
  //- Set patchGroups for constraint patches
  #includeEtc "case_dicts/setConstraintTypes"
  #include "include/fixedInlet"
  outlet
  {
    type            inletOutlet;
    inletValue      $internalField;
    value           $internalField;
  }
  lowerWall
  {
    type            omegaWallFunction;
    value           $internalField;
  }
  motorBikeGroup
  {
    type            omegaWallFunction;
    value           $internalField;
  }
  #include "include/frontBackUpperPatches"
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
