0.1.0/tutorials/incompressible/simple/motor_bike/system/controlDict
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      controlDict;
}

application     mousse-simple;
startFrom       latestTime;
startTime       0;
stopAt          endTime;
endTime         500;
deltaT          1;
writeControl    timeStep;
writeInterval   100;
purgeWrite      0;
//- Uncomment to have regular (every 2 hours of run time) restart files
//secondaryWriteControl    cpuTime; // runtime
//secondaryWriteInterval   7200;    // seconds
//secondaryPurgeWrite      1;       // keep all but last dump
writeFormat     binary;
writePrecision  6;
writeCompression uncompressed;
timeFormat      general;
timePrecision   6;
runTimeModifiable true;
functions
{
  #include "readFields"
  #include "streamLines"
  #include "wallBoundedStreamLines"
  #include "cuttingPlane"
  #include "forceCoeffs"
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
