0.1.0/tutorials/incompressible/simple/motor_bike/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  object      fvSolution;
}

solvers
{
  p
  {
    solver           GAMG;
    tolerance        1e-7;
    relTol           0.01;
    smoother         GaussSeidel;
    nPreSweeps       0;
    nPostSweeps      2;
    cacheAgglomeration on;
    agglomerator     faceAreaPair;
    nCellsInCoarsestLevel 10;
    mergeLevels      1;
  }
  Phi
  {
    $p;
  }
  U
  {
    solver           smoothSolver;
    smoother         GaussSeidel;
    tolerance        1e-8;
    relTol           0.1;
    nSweeps          1;
  }
  k
  {
    solver           smoothSolver;
    smoother         GaussSeidel;
    tolerance        1e-8;
    relTol           0.1;
    nSweeps          1;
  }
  omega
  {
    solver           smoothSolver;
    smoother         GaussSeidel;
    tolerance        1e-8;
    relTol           0.1;
    nSweeps          1;
  }
}
SIMPLE
{
  nNonOrthogonalCorrectors 0;
  consistent yes;
}
potentialFlow
{
  nNonOrthogonalCorrectors 10;
}
relaxationFactors
{
  equations
  {
    U               0.9;
    k               0.7;
    omega           0.7;
  }
}
cache
{
  grad(U);
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
